# LoadCase Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LoadCase Class
Members See Also
---
An object that represents a load usage.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class LoadCase : Element
```

Visual Basic
---
```text
Public Class LoadCase _
	Inherits Element
```

Visual C++
---
```text
public ref class LoadCase : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Structure..::..LoadCase
# See Also
LoadCase Members
Autodesk.Revit.DB.Structure Namespace